Repository: mbits-os/lngs
Catalog: app/data/strings/*.po
Languages: pl

# ARGS_APP_ALT_INCLUDE
source: sets file name to #include in the implementation of the Resource class; defaults to "<project>.hpp".
pl: ustawia nazwę pliku do użycia w #include w implementacji klasy Resource; domyślna wartość to "<project>.hpp".

# ARGS_APP_AUTHOR
source: sets the name and email address of first author
pl: ustawia imię, nazwisko i adres email pierwszego autora

# ARGS_APP_COPYRIGHT
source: sets the name of copyright holder
pl: ustawia nazwę posiadacza praw autorskich

# ARGS_APP_DESCR_CMD_ENUMS
source: Creates header file from message file.
pl: Tworzy plik nagłówka z pliku wiadomości.

# ARGS_APP_DESCR_CMD_FREEZE
source: Reads the language description file and assigns values to new strings.
pl: Czyta plik opisu języka i przypisuje wartości do nowych napisów.

# ARGS_APP_DESCR_CMD_MAKE
source: Translates MO file to LNG file.
pl: Tłumaczy plik MO do pliku LNG.

# ARGS_APP_DESCR_CMD_POT
source: Creates POT file from message file.
pl: Tworzy plik POT z pliku wiadomości.

# ARGS_APP_DESCR_CMD_PY
source: Creates Python module with string keys.
pl: Tworzy moduł języka Python z kluczami napisów.

# ARGS_APP_DESCR_CMD_RES
source: Creates C++ file with fallback resource for the message file.
pl: Tworzy plik C ++ z awaryjnym zasobem dla pliku wiadomości.

# ARGS_APP_DESCR_USAGE
source: [-h] [--version] <command> [<arguments>]
pl: [-h] [--version] <polecenie> [<argumenty>]

# ARGS_APP_FLOW_ROLE_DEV_ADD
source: Developer (adding new string)
pl: Programista (dodawanie nowego napisu)

# ARGS_APP_FLOW_ROLE_DEV_COMPILE
source: Developer (compiling existing list)
pl: Programista (kompilacja istniejącej listy)

# ARGS_APP_FLOW_ROLE_DEV_RELEASE
source: Developer (releasing a build)
pl: Programista (publikowanie kompilacji)

# ARGS_APP_FLOW_ROLE_STRMGR
source: Translation Manager
pl: Menedżer Tłumaczeń

# ARGS_APP_FLOW_ROLE_TRANSLATOR
source: Translator
pl: Tłumacz

# ARGS_APP_FLOW_TITLE
source: The flow for string management and creation
pl: Przepływ zarządzania i tworzenia napisów

# ARGS_APP_IN_IDL
source: sets message file name to read from
pl: ustawia nazwę pliku wiadomości do odczytu

# ARGS_APP_IN_LLCC
source: sets ATTR_LANGUAGE file name with ll_CC (language_COUNTRY) names list
pl: ustawia nazwę pliku ATTR_LANGUAGE z listą nazw ll_CC (język_KRAJ)

# ARGS_APP_IN_MO
source: sets GetText message file name to read from
pl: ustawia nazwę pliku wiadomości GetText do odczytu

# ARGS_APP_KNOWN_CMDS
source: known commands
pl: znane polecenia

# ARGS_APP_META_FILE
source: <file>
pl: <plik>

# ARGS_APP_META_HOLDER
source: <holder>
pl: <posiadacz>

# ARGS_APP_META_MO_FILE
source: <mo file>
pl: <plik mo>

# ARGS_APP_META_TITLE
source: <title>
pl: <tytuł>

# ARGS_APP_NO_COMMAND
source: command missing
pl: brak polecenia

# ARGS_APP_OUT_CPP
source: sets C++ header file name to write results to; use "-" for standard output
pl: ustawia nazwę pliku nagłówkowego C++, aby zapisać wyniki; użyj "-" dla standardowego wyjścia

# ARGS_APP_OUT_IDL
source: sets IDL message file name to write results to; it may be the same as input; use "-" for standard output
pl: ustawia nazwę pliku wiadomości IDL, aby zapisać wyniki; nazwa może być taka sama, jak dla pliku wejściowego; użyj "-" dla standardowego wyjścia

# ARGS_APP_OUT_LNG
source: sets LNG binary file name to write results to; use "-" for standard output
pl: ustawia nazwę pliku binarnego LNG, aby zapisać wyniki; użyj "-" dla standardowego wyjścia

# ARGS_APP_OUT_POT
source: sets POT file name to write results to; use "-" for standard output
pl: ustawia nazwę pliku POT, aby zapisać wyniki; użyj "-" dla standardowego wyjścia

# ARGS_APP_OUT_PY
source: sets Python file name to write results to; use "-" for standard output
pl: ustawia nazwę pliku Python, aby zapisać wyniki; użyj "-" dla standardowego wyjścia

# ARGS_APP_OUT_RES
source: sets C++ code file name with builtin strings to write results to; use "-" for standard output
pl: ustawia nazwę pliku kodu C++ z wbudowanymi napisami, aby zapisać wyniki; użyj "-" dla standardowego wyjścia

# ARGS_APP_RESOURCE
source: instructs the Strings type to use data generated by the `lngs res'.
pl: instruuje typ Strings, aby używał danych generowanych przez `lngs res'.

# ARGS_APP_TITLE
source: sets a descriptive title for the POT project
pl: ustawia opisowy tytuł dla projektu POT

# ARGS_APP_UNK_COMMAND
source: unknown command: {0}
pl: nieznane polecenie: {0}

# ARGS_APP_VERBOSE
source: shows more info
pl: pokazuje więcej informacji

# ARGS_APP_VERSION
source: shows program version and exits
pl: pokazuje wersję programu i wychodzi

# ARGS_APP_WARP_ALL_PLURAL
source: replaces all strings with warped ones; plural strings will still be plural (as if English)
pl: zastępuje wszystkie napisy wypaczonymi; liczba mnoga nadal będzie w liczbie mnogiej (jak w języku angielskim)

# ARGS_APP_WARP_MISSING_SINGULAR
source: replaces missing strings with warped ones; resulting strings are always singular
pl: zastępuje brakujące napisy wypaczonymi; wynikowe napisy są zawsze pojedyncze

# ARGS_APP_WITH_KEY_BLOCK
source: adds block of strings with key names
pl: dodaje blok napisów z nazwami kluczy

# ARGS_ERROR_MSG
source: {0}: error: {1}
pl: {0}: błąd: {1}

# ARGS_HELP_DESCRIPTION
source: shows this help message and exits
pl: pokazuje ten komunikat pomocy i wychodzi

# ARGS_NEEDED_NUMBER_EXCEEDED
source: argument {0}: number outside of expected bounds
pl: argument {0}: liczba poza oczekiwanym zakresem

# ARGS_NEEDS_NUMBER
source: argument {0}: expected a number
pl: argument {0}: oczekiwano liczby

# ARGS_NEEDS_PARAM
source: argument {0}: expected one argument
pl: argument {0}: oczekiwano jednego argumentu

# ARGS_OPTIONALS
source: optional arguments
pl: argumenty opcjonalne

# ARGS_POSITIONALS
source: positional arguments
pl: argumenty pozycyjne

# ARGS_REQUIRED
source: argument {0} is required
pl: argument {0} jest wymagany

# ARGS_UNRECOGNIZED
source: unrecognized argument: {0}
pl: nierozpoznany argument: {0}

# ARGS_USAGE
source: usage:
pl: użycie:

# ERR_ATTR_EMPTY
source: attribute `{0}' should not be empty
pl: atrybut `{0}' nie powinien być pusty

# ERR_ATTR_MISSING
source: attribute `{0}' is missing
pl: brak atrybutu `{0}'

# ERR_EXPECTED
source: expected {0}, got {1}
pl: oczekiwano {0}, znaleziono {1}

# ERR_EXPECTED_GOT_ID
source: identifier
pl: identyfikator

# ERR_EXPECTED_GOT_NUMBER
source: number
pl: liczbę

# ERR_EXPECTED_GOT_STRING
source: string
pl: napis

# ERR_EXPECTED_GOT_UNRECOGNIZED
source: unrecognized text
pl: nierozpoznany tekst

# ERR_EXPECTED_ID
source: identifier
pl: identyfikatora

# ERR_EXPECTED_NUMBER
source: number
pl: liczby

# ERR_EXPECTED_STRING
source: string
pl: napisu

# ERR_FILE_MISSING
source: could not open `{0}'
pl: nie można otworzyć pliku `{0}'

# ERR_FILE_NOT_FOUND
source: could not open the file
pl: nie można otworzyć pliku

# ERR_GETTEXT_BLOCKS_OVERLAP
source: two or more blocks occupy the same space
pl: dwa lub więcej bloków zajmuje tą samą przestrzeń

# ERR_GETTEXT_FILE_TRUNCATED
source: file truncated; data missing
pl: plik obcięty; brak oczekiwanych danych

# ERR_GETTEXT_FORMAT
source: gettext file format error
pl: błąd formatu pliku gettext

# ERR_GETTEXT_NOT_ASCIIZ
source: strings must end with a zero
pl: napisy muszą kończyć się zerem

# ERR_GETTEXT_STRING_OUTSIDE
source: string not contained inside the block
pl: napis nie zawiera się wewnątrz bloku

# ERR_ID_MISSING_HINT
source: before finalizing a value, use `id(-1)'
pl: przed sfinalizowaniem wartości należy używać `id(-1)'

# ERR_LOCALE_MISSING
source: no {0} locale on the list
pl: nazwy dla ustawień regionalnych {0} nie ma na liście

# ERR_MSGS_ATTR_LANG_MISSING
source: message file does not contain Language attribute
pl: plik wiadomości nie zawiera atrybutu Language

# ERR_MSGS_TRANSLATION_MISSING
source: message file does not contain translation for "{0}"
pl: plik wiadomości nie zawiera tłumaczenia dla "{0}"

# ERR_NOT_STRINGS_FILE
source: `{0}' is not strings file
pl: `{0}' nie jest plikiem napisów

# ERR_NO_NEW_STRINGS
source: no new strings
pl: brak nowych napisów

# ERR_REQ_ATTR_MISSING
source: required attribute `{0}' is missing
pl: brak wymaganego atrybutu `{0}'

# ERR_UNANMED_LOCALE
source: locale {0} has no name
pl: ustawienia regionalne {0} nie mają nazwy

# SEVERITY_ERROR
source: error
pl: błąd

# SEVERITY_FATAL
source: fatal
pl: błąd krytyczny

# SEVERITY_NOTE
source: note
pl: nota

# SEVERITY_WARNING
source: warning
pl: ostrzeżenie
